Public Member Functions | Public Attributes | List of all members
API_PropertyDefaultValue Struct Reference
Property Manager
A structure representing a property default value. More...
#include <APIdefs_Properties.h>
 Public Member Functions
API_PropertyDefaultValue ()
 Public Attributes
API_PropertyValue  | basicValue
The basic default value when not using an expression. This content of this value is undefined when expression is used.
GS::Array< GS::UniString >  | propertyExpressions
The list of expression strings in the default value. The content of this array is undefined when basic default value is used.
bool  | hasExpression
Specifies if the default value holds expression or not.
Detailed Description
A structure representing a property default value.
Constructor & Destructor Documentation
◆ API_PropertyDefaultValue()
 API_PropertyDefaultValue::API_PropertyDefaultValue  |  ( |   | )
inline
Member Data Documentation
◆ basicValue
 API_PropertyDefaultValue::basicValue
The basic default value when not using an expression. This content of this value is undefined when expression is used.
◆ hasExpression
 API_PropertyDefaultValue::hasExpression
Specifies if the default value holds expression or not.
◆ propertyExpressions
 API_PropertyDefaultValue::propertyExpressions
The list of expression strings in the default value. The content of this array is undefined when basic default value is used.